'''
一 下面列表：

a = [1,2,3,4,5,333,11,44]

输出下面的结果：

[4,5,333]
'''
print('第一题：')
a = [1, 2, 3, 4, 5, 333, 11, 44]
print(a[3:6])
'''
二 有下面2个列表

a = [1,2,3]
b = [4,5,6]

用2个方法输出下面结果：

[1,2,3,4,5,6]
'''
print('第二题：')
a = [1, 2, 3]
b = [4, 5, 6]
# 第一种方法：
print(a + b)
# 第二种方法：
a.extend(b)
print(a)

'''
三 有下面2个列表：

a = [1,99,33,44,55,22]

输出结果:

1：[1,2,99,33,44,55,22,(11,33,54)]

2: [1,2,99,33,101,44,55,22]

'''
print('第三题：')
a = [1, 99, 33, 44, 55, 22]
# 添加指定位置元素
a.insert(1, 2)
# 添加到末尾处
a.append((11, 33, 54))
print(a)
a.insert(4, 101)
a.remove((11, 33, 54))
print(a)
'''
四：用列表推导式生成100内的大于20的偶数
'''
print('第四题：')
print([x for x in range(21, 101) if x % 2 == 0])
